[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        this._last = 0;
-        if (faces < 2) 
-            this._faces = 6;
-        else
-            this._faces = Math.trunc(faces);
-        this._distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            this._distribution.set(i, 0);
-        }
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Test Faces Basic Happy Test to check _faces is inited if valid given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:11:13
     // six-sided die.
     constructor(faces: number) {
         this._last = 0;
-        if (faces < 2) 
+        if (faces <= 2) 
             this._faces = 6;
         else
killedBy: Test Faces Basic Happy Test to check _faces is inited if valid given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 6

[Killed] ConditionalExpression
src/Roller.ts:11:13
     // six-sided die.
     constructor(faces: number) {
         this._last = 0;
-        if (faces < 2) 
+        if (true) 
             this._faces = 6;
         else
killedBy: Test Faces Basic Happy Test to check _faces is inited if valid given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 6

[Killed] BlockStatement
src/Roller.ts:31:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        var trunc_val = Math.trunc(value);
-        if (trunc_val < 1 || trunc_val > this._faces)
-            return 0;
-        else {
-            var cur: number = this._distribution.get(trunc_val);
-            this._distribution.set(trunc_val, ++cur);
-            this._last = trunc_val;
-            return trunc_val;
-        }
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Test Basic Roll Happy Test to check roll Basic Valid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: undefined

[Killed] LogicalOperator
src/Roller.ts:33:13
     //      of rolls for that face by 1
     roll(value: number): number{
         var trunc_val = Math.trunc(value);
-        if (trunc_val < 1 || trunc_val > this._faces)
+        if (trunc_val < 1 && trunc_val > this._faces)
             return 0;
         else {
killedBy: Test Basic Roll Invalid Larger Test to check roll Basic Invalid Larger
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 3

[Killed] EqualityOperator
src/Roller.ts:33:30
     //      of rolls for that face by 1
     roll(value: number): number{
         var trunc_val = Math.trunc(value);
-        if (trunc_val < 1 || trunc_val > this._faces)
+        if (trunc_val < 1 || trunc_val >= this._faces)
             return 0;
         else {
killedBy: Test Basic Roll Happy Test to check roll Basic Valid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/Roller.ts:35:14
         var trunc_val = Math.trunc(value);
         if (trunc_val < 1 || trunc_val > this._faces)
             return 0;
-        else {
-            var cur: number = this._distribution.get(trunc_val);
-            this._distribution.set(trunc_val, ++cur);
-            this._last = trunc_val;
-            return trunc_val;
-        }
+        else {}
     }
 
killedBy: Test Basic Roll Happy Test to check roll Basic Valid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: undefined

[Killed] UpdateOperator
src/Roller.ts:37:47
             return 0;
         else {
             var cur: number = this._distribution.get(trunc_val);
-            this._distribution.set(trunc_val, ++cur);
+            this._distribution.set(trunc_val, --cur);
             this._last = trunc_val;
             return trunc_val;
killedBy: Test Basic Distro Happy Test to check Distrobution Valid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: -2

[Killed] BlockStatement
src/Roller.ts:59:25
     }
 
     //Getting for the number of faces on the initialized dice
-    get_faces(): number {
-        return this._faces;
-    }
+    get_faces(): number {}
 } // end of Roller class
killedBy: Test Faces Basic Happy Test to check _faces is inited if valid given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined
